package Ch06;

public class Quiz_9 {

	public static void main(String[] args) {
//		다음 중 this에 대한 설명으로 맞지 않은 것은 (모두 고르시오)  ? 
//				1. . 객체 자신을 가리키는 참조변수이다
//				2. . 클래스 내에서라면 어디서든 사용할 수 있다 → 인스턴스메서드에서만 사용가능
//				3. . 지역변수와 인스턴스변수를 구별할 때 사용한다
//				4. . 클래스 메서드 내에서는 사용할 수  없다
//				
//				[ 정답 ] 2
//				[해설 ] 
//				2.  클래스 내에서라면 어디서든 사용할 수 있다
//				→ 클래스 멤버(static 이 붙은 변수나 메서드) 에는 사용할 수 없다  .
//				
//				this , 는 인스턴스 자신의 주소를 저장하고 있으며 모든 인스턴스메서드에 숨겨진 채로 존
//				재하는 지역변수이다 그래서 인스턴스메서드 내에서만 사용할 수 있다 . 		
//				
//				
//				
				
	}

}
