package Ch06;

public class Quiz_14 {

	public static void main(String[] args) {
//		다음 중 지역변수에 대한 설명으로 옳지 않은 것은 모두 고르시오 ? ( )
//				1. . 자동 초기화되므로 별도의 초기화가 필요없다
//				2. . 지역변수가 선언된 메서드가 종료되면 지역변수도 함께 소멸된다
//				3. . 매서드의 매개변수로 선언된 변수도 지역변수이다
//				4. . 클래스변수나 인스턴스변수보다 메모리 부담이 적다
//				5. (heap) . 힙 영역에 생성되며 가비지 컬렉터에 의해 소멸된다
//				[정답 ]  1, 5
//				[해설 ]  지역변수는 자동 초기화 되지 않기 때문에 사용하기 전에 반드시 적절한 값으로
//				초기화를 해주어야한다 지역변수는 자신이 선언된 블럭이나 메서드가 종료되면 소멸되므 .
//				로 메모리 부담이 적다 힙 영역에는 인스턴스 인스턴스변수 가 생성되는 영역이며 . (heap) ( ) ,
//				지역변수는 호출스택 에 생성된다 

	}

}
