package Ch06;

public class Quiz_10 {

	public static void main(String[] args) {
//		다음 중 오버로딩이 성립하기 위한 조건이 아닌 것은 (모두 고르시오) ?
//				1. . 메서드의 이름이 같아야 한다
//				2. . 매개변수의 개수나 타입이 달라야 한다
//				3. . 리턴타입이 달라야 한다
//				4. . 매개변수의 이름이 달라야 한다
//				[정답 ]  3, 4
//				
//				
//				[해설 ] 
//				3. . 리턴타입이 달라야 한다
//				→ 리턴타입은 오버로딩에 영향을 주지 못한다.
//				4. . 매개변수의 이름이 달라야 한다
//				→ 리턴타입은 오버로딩에 영향을 주지 못한다.
//				<<  오버로딩의 조건>>
//				1. . 메서드 이름이 같아야 한다
//				2. . 매개변수의 개수 또는 타입이 달라야 한다
//				3. 매개변수는 같고 리턴타입이 다른 경우는 오버로딩이 성립되지 않는다
//				(  리턴타입은 오버로딩을 구현하는데 아무런 영향을 주지 못한다)
	}

}
