package Ch06;

public class Quiz_8 {

	public static void main(String[] args) {
//		다음 중 생성자에 대한 설명으로 옳지 않은 것은 모두 고르시오 ? ( )
//				1. . 모든 생성자의 이름은 클래스의 이름과 동일해야한다
//				2. . 생성자는 객체를 생성하기 위한 것이다
//				3. . 클래스에는 생성자가 반드시 하나 이상 있어야 한다
//				4. . 생성자가 없는 클래스는 컴파일러가 기본 생성자를 추가한다
//				5. . 생성자는 오버로딩 할수없다
//		[정답]  2, 5
//		[해설] 
//		2. . 생성자는 객체를 생성하기 위한 것이다
//		→ 생성자가 객체를 생성할 때 사용되기는 하지만 객체를 초기화할 목적으로 사용되는 ,
//		것이다 객체를 생성하는 것은 연산자이다 . new .
//		5. . 생성자는 오버로딩 할 수 없다
//		→ 생성자도 오버로딩이 가능해서 하나의 클래스에 여러 개의 생성자를 정의할 수 있
//		다
	}

}
